# برای ایجاد متغیر
names = 'value'


#  برای ایجاد کامنت
# Comment
""" for lines commit and Documints """


# برای پرینت کردن 
print(names) # 'value'
print(names, end='\t') # برای جدا خروجی این متد از مابقی کد ها - دیفالت خط بعدی است
print(names , sep='*') # جدا کردن آیتم ها با کارکتر داده شده - دیفالت اسپیس است
print(names , file='f') # بجای نمایش در ترمینال آن را در فایل داده شده ذخیره میکند
print(names , flush=True , file='f') # منتظر اتمام دستورات نباش سریع در فایل ذخیره کن (ذخریه کن و کش را خالی کن) - دیفالت فالس
pprint('mohammad','karinpour') # خروجی را با فرمتی خوانا تر نشان میدهد


# دریافت ورودی از کاربر در درمینال
# اینپوت یک رشته است و تمامی متد های رشته روی آن جواب میدهند
age = input('what is your age?')


# برای پاک کردن متغیر
del names



# نمایش متد های یک دستور
print(dir(list))