# متد های استرینگ
name = "mohammad karimpour"

len(name) # طول رشته

name.upper() # تبدیل به حروف بزرگ

name.lower() # تبدیل به حروف کوچک
name.casefold() #  قوی تر 

name.count("m") # کارکتر پقدر تکرار شده 

name.endswith("pour") # با این کارکتر تمام شده؟

name.startswith("pour") # با این کارکتر شروع شده؟

name.find("d") # جستجوی کارکتر

name.rfind("k") # جستجوی کارکتر از آخر

name.isalnum() # فقط حروف و عدداست؟

name.isnumeric() # فقط عدد است؟

name.join([1,2,3]) # بین آیتم های لیست داده شده همان رشته را جا گذاری میکند

name.replace("m","@") # تغیر کارکتر های رشته

name.strip() # حذف کارکتر خاصی از اول و آخر رشته که به صورت دیفالت اسپیس ها را حدف میکند

name.lstrip("+") # ازاول کارکتر های خاص را حذف میکند

name.rstrip()# ازآخر کارکتر های خاص را حذف میکند

name.capitalize() # حرف اول رشته را بزرگ میکند

name.center(10,'*') # کارکتر را به وسط میرساند و چپ و راستش را با کارکتر داده شده پر میکند (***sana***)

name.index() # طول رشته را برمیگرداند

name.isalpha() # اگر تمامی کارکتر ها حروف البا باشد ترو را برمیگرداند

name.isdecimal() # اگر تمامی کارکتر ها عدد باشد ترو را برمیگرداند

name.isidentifier() # هر عبارتی برای نام گذاری برای متغیر و غیره مناسب باشد ترو را برمیگرداند

name.title() # حروف اول کلمات رشته را بزرگ میکند

name.ljust(10,'+') # همان (center)فقط برای سمت چپ (+++++faeze)
name.rjust(10,'#') # برای سمت راست (faeze#####)

name.removeprefix('b') # کارکتر داده شده را از اول شروع میکند به حدف کردن
name.removesuffix('Y') # از آخر

name.lstrip()
name.rstrip()

name.rsplit('s') # جدا کردن کلمات رشته بر اساس کارکتر دادخ شده از اول
name.lsplit('r') # از آخر

name.swapcase() # کوچک را بزرگ و بزرگ را به کوچک تبدیل میکند