# متد های لیست
num = [1,2,3,4,5,'faeze',True]
num_2 = [10,20,30,40,50]


del num[2,3] # حذف آیتم های آرایه

num.append(10,20,30) # اضافه کردن آیتم به آرایه

zip(num,num_2) # ترکیب دو آرایه با هم

enumerate(num_2) # برگرداندن هر آیتم یه صورت تاپل داخل یک لیست با ایندکسش [(0,10),(1,20)...]


a = map(lambda x: x*2, num_2) # تابع روی هر آیتم لیست تغیرات داده شده را اعمال میکند
print(a) # 20 , 40 , 60 , 80 , 100


b = filter(lambda x: x%2 == 0, num_2) # بر اساس دستوری که به تابع داده شده لیست را فیلتر میکند

num.clear() # پاک کردن کل آیتم های لیست

num_2.copy() # کپی کردن از لیست

num.count() # تعداد تکرار آیتم های تکراری

num_2.extend([2,3]) #  اضافه کردن چند آیتم

num.index(5,2,5) # موقعیت قرار گیری آیتم داده شده را پیدا میکند - (تا - از - آیتم مورد نظر)

num_2.insert(4,23) # اضافه کردن آیتم در موقعیت داده شده (موقعیت - آیتم)

num.pop(2) #   ایندکس داده شده را حذف میکند - اگر ایندکس ندید آخرین آیتم را حذف میکند

num_2.remove(8) # آیتم مورد نظر را حذف میکند

num.reverse() #  برعکس کردن لیست

num_2.sort(reverse=True , key=lambda x: x*2) #  مرتب سازی لیست (reverse = معکوس فعال شود - key = مرتب سازی بر اساس همان تابع انجام شود)اختیاری

