# عملگر والروس (:=)
# شما میتوانید در جا های خاص هم متغیر تعریف و مقدار دهی کنید و همزمان ازش استفاده کنید
# بدون ایجاد اختلال در عملکرد کد

# جاهای خاص مانند => پرینت - شرط - ورودی تابع 

def num(m):
    pass

num(x :=5) # هم متغیری تعریف شد و با 5 مقدار دهی شد و هم ورودی فانگشن داده شد 
print(x) # 5


print(F"my number is : {(number := 2004)} and my age : {2023 - number}") # my number is : 2004 and my age : 19
#  در اینجا هم یک عدد را به استرینگ دادیم و هم متغیری را تعریف کردیم و همزمان بعد از آن دوباره از آن استفاده کردیم

