# چکیج ها

# برای ساخت پکیج حتما باید داخل پوشه فایل اینیت باشد
""" __init__.py """
# هر دستوری که داخل فایل اینیت بنویسید به محض ایمپورت اجرا میشوند



# برای ایمپورت کردن فایلی که داخل پکیجی هست(پوشه)
#  import(اسم پوشه).(اسم فایل)
import pk01.num.py


# اگر میخواهید با ایمپورت همه ی فایل ها (* همه)ماژول های یک پکیج رو ایمپورت کنید باید در فایل اینیت آن ها را معرفی کنید
__all__ = ['num_1.py','num_2.py']
from pk_1 import * # => num_1 , num_2



# در همان پکیج بگرد
from .py10 import *
# برو به پکیج پدرت (یک پوشه برگرد)
from ..ts import ts2