""" داک استرینگ در کلاس """

class Doc:
    """
    توضیح کلی از عملکرد کلاس
    شما میتوانید از صفات و متد کلاس بگوید و حتی مثال واقعی هم بزنید

    >>> P_1 = Doc(12)
    >>> P_1.num
    12

    مثال هارو بعد علامت مد نظر مینویسم و خروجی که انتظار داریم رو در پایین همان مثال مینویسیم
    """
    def __init__(self,num):
        self.num = num


# ما میتوانیم با پکیجی آن مثال را تست کنیم که آیا خروجی مد نظر درست است یا نه
import doctest
doctest.testmod() # مثال شما را تست میکند و با خروجی مد نظر شما و خروجی واقعی نشان میدهد




#  گرفتن داک استرینگ
print(Doc.__doc__)
print(help(Doc))
